class CStrLib
{
	construct()
	{
		init();
	}
	init()
	{
		this.lib_names = new Array("Авраам", "Ада", "Адам", "Аза", 
							"Аким", "Алан", "Алана", "Алиса", 
							"Амалия", "Амира", "Амирам", "Анна", 
							"Арам", "Ариана", "Вадим", "Вета", 
							"Давид", "Далида", "Дана", "Даниил", 
							"Данислав", "Даниэла",  "Дара", "Даяна", 
							"Джеймс", "Джереми",  "Иеремия", "Джозеф", 
							"Дина", "Ева",  "Елизавета", "Елисей", 
							"Ефрем", "Жанна",  "Жозефина", "Захар", 
							"Злата", "Иисус",  "Илья", "Иоанна", 
							"Исаак", "Исаакий",  "Исмаил", "Итан", 
							"Ким", "Лилия",  "Лиора", "Лия", 
							"Магда", "Магдалeна",  "Марианна", "Мария", 
							"Марта", "Марфа",  "Матвей", "Мирра", 
							"Михаил", "Моисей",  "Назар", "Наоми", 
							"Осип", "Иосиф",  "Равиль", "Рамон", 
							"Ранель", "Рафаэль",  "Римма", "Рина", 
							"Рубен", "Руфь",  "Савва", "Савелий", 
							"Самуил", "Сара",  "Серафима", "Сусанна", 
							"Тамара", "Томас", "Яков", "Ян",
							"Шелли", "Эвелина", "Эвита", "Элеонора", 
							"Элиана", "Элина", "Элла", "Эля", "Эмма");

		this.lib_names_count = this.lib_names.length;
		this._nextIndex = 0;
		this._prefix = 0;
	}

	getNextName()
	{
	  var nextName = this.lib_names[this._nextIndex];
	  this._nextIndex++;
	  if(this.lib_names_count <= this._nextIndex)
	  {
	  	this._nextIndex = 0;
	  	this._prefix++;
	  }

	  if(this._prefix > 0)
	  {
	  	nextName+= "_"+this._prefix;
	  }
	  return nextName;
	}
}

var strLib = new CStrLib();
strLib.init();